# Groupby

In [13]:
import pandas as pd
var = pd.DataFrame({"name":["a","b","c","d","a","b","a","b","a","c","c","d"],
                     "S_1":[12,13,14,12,13,14,15,23,25,16,10,34],
                    "s_2":[22,24,25,26,27,28,29,30,25,34,35,56]})
var

   name  S_1  s_2
0     a   12   22
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     a   15   29
7     b   23   30
8     a   25   25
9     c   16   34
10    c   10   35
11    d   34   56

In [23]:
var_new = var.groupby("name")
var_new

In [29]:
for x,y in var_new:
    print(x)  # Group name (e.g., "a")
    print(y)  # DataFrame with rows for that group
    print()

a
  name  S_1  s_2
0    a   12   22
4    a   13   27
6    a   15   29
8    a   25   25

b
  name  S_1  s_2
1    b   13   24
5    b   14   28
7    b   23   30

c
   name  S_1  s_2
2     c   14   25
9     c   16   34
10    c   10   35

d
   name  S_1  s_2
3     d   12   26
11    d   34   56

In [35]:
# var_new.get_group("d")
var.groupby("name").get_group("d")

   name  S_1  s_2
3     d   12   26
11    d   34   56

In [41]:
# var_new.min()
# var_new.max()
var_new.mean()

            S_1        s_2
name
a     16.250000  25.750000
b     16.666667  27.333333
c     13.333333  31.333333
d     23.000000  41.000000

In [43]:
list(var_new)

[('a',
    name  S_1  s_2
  0    a   12   22
  4    a   13   27
  6    a   15   29
  8    a   25   25),
 ('b',
    name  S_1  s_2
  1    b   13   24
  5    b   14   28
  7    b   23   30),
 ('c',
     name  S_1  s_2
  2     c   14   25
  9     c   16   34
  10    c   10   35),
 ('d',
     name  S_1  s_2
  3     d   12   26
  11    d   34   56)]